<script setup lang="ts">
import { useCssVar } from '@vueuse/core'

const color1 = useCssVar("--vt-c-white");
// 修改body背景色
color1.value = '#e3d1bd';

const color2 = useCssVar("--vt-c-indigo");
// 修改段落文字颜色
color2.value = '##333';
</script>

<template>
  <!-- 文章 开始-->
  <div class="read-content">
    <div class="article">
      <h2>第一章重生</h2>
      <p></p>
      <p>“我没死？”</p>
      <p>柳无邪是被疼醒的，身上压着几块碎木头，让他喘不上气来。</p>
      <p>接着，一团凌乱的记忆，钻入他的脑海。</p>
      <p>他本是凌云仙界十大仙帝之一，机缘巧合，拾到太荒神器——《吞天神鼎》，遭整个仙界围攻，命丧断魂崖。</p>
      <p>最后一刻，施展血魔解体术，跟他们同归于尽，炸碎了吞天神鼎，醒来的时候，已经到了这里。</p>
      <p>“真武大陆……徐家……上门女婿……败家子……”</p>
      <p>脑海中出现的记忆告诉他，他已经不在凌云仙界，而是重生一个叫真武大陆的位面。</p>
      <p>而这个少年的身体同样也叫柳无邪，出生富贵人家，五岁时家道变故，父母离奇失踪，造成他从小就性格狭隘、孤僻。被父亲好友、未来的岳父徐义林收养后，也未见好转。</p>
      <p>随着年龄的增长，性格越来越乖张跋扈，甚至认为对他视如己出的岳父图谋他得家业才收养他，疯狂败家瞎混，成为沧澜城有名的败家子。</p>
      <p>整个徐家，无一不用废物、蛀虫、垃圾来形容他，依旧我行我素。</p>
      <p>转眼到了成亲年纪，岳父徐义林认为结了婚之后，性格也许会收敛。而今天，就是他的大婚之日。</p>
      <p>按理说，他这样的垃圾不可能配得上徐家大小姐。</p>
      <p>那是因为柳无邪的父母跟徐义林乃生死之交，两家早已指腹为婚，约定年满十八，即可完婚。</p>
      <p>大婚之日，进入洞房后被徐家大小姐打出，在几名狐朋好友唆使下，第一次踏入青楼，突然狂性大发，引燃火烛，导致整个青楼塌陷，悲剧的他，被埋在废墟下面。</p>
      <p>挪开压在身上的碎木，平躺在地面上，开始检查身体。</p>
      <p>“好狠的手段，一掌命中心脉，如果不是我附身过来，必死无疑，到底是谁想要杀他，布下这样一个局。”</p>
      <p>除了一些砸伤之外，最致命来自胸口一道诡异的掌印，他清楚的记得，当时跟几个狐朋狗友一起喝酒，失控后的记忆完全记不起来了。</p>
      <p>断开的心脉只是暂时压制住，需要寻找护脉丹药，重新续接，以他的手段，炼制这种丹药不难。</p>
      <p>“还好，这是一座修行者大陆，武道极其昌盛……”</p>
      <p>武者有诸多等级，分为后天、先天、洗灵、洗髓、真丹……</p>
      <p>“这糟糕的身体，用废物来形容都抬举他了。”</p>
      <p>筋脉细如发丝，杂质造成的拥堵，只能用惨不忍睹来形容。</p>
      <p>“有些麻烦了，我所有的修炼法决，皆为仙界神级功法，真武大陆不过凡界位面，我必须要改修凡界武者的功法才可以。”</p>
      <p>打个比方，就好比一个婴儿，身旁虽然摆放着神兵利器，以婴儿的力气，根本无法拿起这些神兵。</p>
      <p>想要拿起神兵，必须要成长到一定的程度才可以，至少要达到洗髓境。</p>
      <p>尴尬！</p>
      <p>柳无邪感觉自己尬的要死，尝试好几次，每次都无功而返，筋脉传来的撕裂感，让他痛不欲生，在修炼下去，肉身必定四分五裂。</p>
      <p>这时！</p>
      <p>一滴精纯的液体，从他丹田之中流出，冲向筋脉，流入四肢百骸。</p>
      <p>羸弱的经脉，犹如贪婪的馋虫，疯狂的吞噬液体，里面的淤泥，一点点溶解，浑身舒泰。</p>
      <p>“什么情况？”</p>
      <p>神识沉入丹田，查看究竟，这一滴液体是怎么回事？从何而来。</p>
      <p>进入丹田的那一刻，脑袋差点炸开，一尊漆黑的神鼎，盘踞丹田中央位置，液体正是从神鼎之中流出。</p>
      <p>“这是……这是吞天神鼎，它竟然跟我一起过来了。”</p>
      <p>吞天神鼎最后时刻跟他一起炸开，却没想到，出现在他丹田里面。</p>
      <p>“难道说……我能重生，跟吞天神鼎有密不可分的关系……”</p>
      <p>突然间！</p>
      <p>一股庞大的黑色气体，从鼎中冲出，击中柳无邪的意识。</p>
      <p>黑色气体不断的翻腾变化，最后化为一道道漆黑的文字，古老且沧桑，充满岁月的痕迹，强横的冲击力，将他的意识从身躯之中震退，回到现实当中。</p>
      <p>来不及整理大脑中的文字，外面传来一阵嘈杂声。</p>
      <p>他头顶上的碎石一点点被挪开，露出一些光线，许多人手举着火把，聚集在四周。</p>
      <p>“老爷，找到姑爷了”</p>
      <p>几名壮汉搬开碎木，也该他命不致死，一节横梁恰好拦住了砸下来的巨石，肉身并未遭到太多创伤，真正死亡原因，来自那致命一掌。</p>
      <p>手忙脚乱把他抬出来，放在地面上，得到神秘液体滋养，身体基本无大碍，直立坐起来。</p>
      <p>“你这个孽障，你要气死我吗！”</p>
      <p>这时，徐义林出现在他面前，一副恨铁不成钢的样子，气的吹胡子瞪眼，得知女婿大闹青楼，被压在下面，连外衣都没来得及穿，只套着一件披风就赶出来。</p>
      <p>奇怪的是，面对徐义林的责骂，柳无邪心里流过一丝暖流，他能感觉到，徐义林真的担心他。</p>
      <p>“这个废物竟然没死？”</p>
      <p>一道突兀的惊叫声，打断他们之间谈话，四方围观数百人，指指点点。</p>
      <p>“这蛀虫还真是命大，这样都没砸死他，老天真是不开眼啊！”</p>
      <p>“徐家造的什么孽，招这样的赘婿上门，丢尽了徐家的脸面。”</p>
      <p>“废物就是废物，今天是他大婚之日，晚上跑来逛青楼，兽性大发，撕开青楼女子衣服，险些酿成大祸，苍天不公，这样的废物，为什么不夺走他的性命。”</p>
      <p>“……”</p>
      <p>四方大量的讥讽声，如同潮水一般，劈头盖脸，落在柳无邪一人身上。</p>
      <p>“额……”</p>
      <p>柳无邪一头黑线，却无力反驳。</p>
      <p>徐义林老脸通红，让人赶紧抬着他，先回去再说，别再这里丢人现眼了。</p>
      <p>“站住！”</p>
      <p>一道冷喝声在他身后响起，打断了他们的脚步。</p>
      <p>一老鸨带着十名护卫，快步走过来，凶神恶煞，一群人气势汹汹。</p>
      <p>“徐家主，令婿害的我们怡红院坍塌，几十人受伤，姑娘吓得不敢出门，许多宾客还在医馆疗伤，这一切都是因他而起，难道打算拍拍屁股就走人吗？”</p>
      <p>老鸨四十多岁，脸上涂着厚厚的胭脂粉，刺鼻的香气，有些呛人，一张吊死鬼的脸看起来让人恶心，站在柳无邪面前，大呼小叫。</p>
      <p>“赔偿的事情，我会安排人过来商谈。”</p>
      <p>徐义林狠狠瞪了一眼柳无邪，不是训斥他的时候，等回家再说。</p>
      <p>“不用了，损失的费用，我自己会赔偿。”</p>
      <p>柳无邪站起来，事情因他而起，不想牵连太多人。</p>
      <p>“柳公子，不是我贬低你，你拿什么赔偿。”</p>
      <p>老鸨一点不给他面子，当着徐义林的面嘲笑他，四方传来阵阵笑声。</p>
      <p>“放心，赔偿一分不会少了你，我徐义林担保，三日之内，赔偿必定送到你手上。”</p>
      <p>徐义林义正言辞，做出保证，这才放他们离开。</p>
      <p>让柳无邪一阵感慨：“前身是不是脑袋有问题，一看岳父就是真的关心他……”</p>
      <p>跟在徐义林身后，柳无邪一言不发。</p>
      <p>对徐家，他还是很感激，落魄的时候，是徐家拉他一把，徐义林更是遵守承诺，将宝贝女儿许配给自己，这一点可以证明，他是重情重义之人。</p>
      <p>天色渐渐亮了，徐家大门打开，两名小厮正要打扫门外落叶，见到徐义林，纷纷行礼，至于柳无邪，将之无视。</p>
      <p>“你回去换套衣服，一会到正厅来见我。”</p>
      <p>身上都是灰尘，衣服破碎，跟个叫花子一样，徐义林让他先回去收拾一下。</p>
      <p>“是。”</p>
      <p>柳无邪对这个岳父，心存畏惧，还有一丝尊敬，这些年没有徐家，他不知死了多少次。</p>
      <p>新书新的起航，让大家久等了，雕琢了两个月，一定不会让大家失望，先看几十章再说，不好看来打我。</p>
    </div>

    <!-- 页面中的固定位置 开始-->
    <div class="fix">
      <!--文章头部  开始-->
      <div class="header">
        <span class="headLeft">
          <i>《<a href="https://www.ireader.com.cn/index.php?ca=bookdetail.index&amp;pca=Chapter.Index&amp;bid=12286678">太荒吞天诀</a>》</i>
          <em> - 第一章青楼</em>
        </span>
      </div>
      <!-- 文章头部 结束-->
    </div>
  </div>
  <!-- 文章 结束-->

</template>

<style scoped>
.read-content {
  width: 40.625rem;
  min-height: 100%;
  background-color: #f8f0e7;
  margin: 0 auto;
  padding: 0 3.125rem;
}

.article {
  width: 40.625rem;
  overflow: hidden;
  padding-bottom: 6.25rem;
  font-size: 1rem;
  letter-spacing: .125rem;
}

.article h2 {
  width: 40.625rem;
  padding: 7.25rem 0 3.125rem;
  text-align: center;
  font-size: 1.125rem;
  font-weight: 37.5rem;
}

.article p {
  text-indent: 2em;
  padding-bottom: 1rem;
  line-height: 2.1875rem;
}

.fix {
  width: 46.875rem;
  position: fixed;
  left: 50%;
  top: 0;
  margin-left: -23.4375rem;
}

.header {
    width: 40.625rem;
    height: 4.0625rem;
    border-bottom: 1px solid #c7c7c7;
    background: #f8f0e7;
    position: absolute;
    left: 50px;
    top: 0;
    overflow: hidden;
}
</style>
